Repository: nagiashraf/car-rental-app
Catalog: src/client/src/locale/messages.*.xlf
Languages: ar, es, fr

source: car brand
ar: علامة السيارة
es: marca de coche
fr: marque de voiture

source: book now
ar: احجز الآن
es: reservar ahora
fr: réserver maintenant

source: How old do I need to be to rent a car?
ar: ما هو العمر الذي يجب أن أكون عليه لاستئجار سيارة؟
es: ¿Qué edad debo tener para alquilar un coche?
fr: Quel âge dois-je avoir pour louer une voiture ?

source: The minimum age requirement for renting a car varies by location and car rental company. Typically, it's between 21 and 25 years old. Additional fees or restrictions may apply to renters under 25.
ar: متطلبات العمر الأدنى لاستئجار سيارة تختلف حسب الموقع وشركة تأجير السيارات. عادةً، تتراوح بين 21 و 25 عامًا. قد تنطبق رسوم إضافية أو قيود على المستأجرين دون سن 25 عامًا.
es: El requisito de edad mínima para alquilar un coche varía según la ubicación y la empresa de alquiler de coches. Normalmente, está entre 21 y 25 años. Pueden aplicarse tarifas adicionales o restricciones a los arrendatarios menores de 25 años.
fr: L'âge minimum requis pour louer une voiture varie en fonction de l'endroit et de la société de location de voitures. En général, il se situe entre 21 et 25 ans. Des frais supplémentaires ou des restrictions peuvent s'appliquer aux locataires de moins de 25 ans.

source: What documents do I need to rent a car?
ar: ما هي الوثائق التي أحتاجها لاستئجار سيارة؟
es: ¿Qué documentos necesito para alquilar un coche?
fr: Quels documents dois-je présenter pour louer une voiture ?

source: You'll typically need a valid driver's license, a credit card in the renter's name for payment and deposit, and an additional form of identification like a passport.
ar: عادةً، ستحتاج إلى رخصة قيادة سارية، وبطاقة ائتمان باسم المستأجر للدفع والوديعة، ونموذج إضافي للتعريف مثل جواز السفر.
es: Por lo general, necesitarás una licencia de conducir válida, una tarjeta de crédito a nombre del arrendatario para el pago y el depósito, y una forma adicional de identificación como un pasaporte.
fr: Vous aurez généralement besoin d'un permis de conduire valide, d'une carte de crédit au nom du locataire pour le paiement et la caution, ainsi que d'une pièce d'identité supplémentaire comme un passeport.

source: Can I add an additional driver to my rental agreement?
ar: هل يمكنني إضافة سائق إضافي إلى عقد الإيجار الخاصة بي؟
es: ¿Puedo añadir un conductor adicional a mi contrato de alquiler?
fr: Puis-je ajouter un conducteur supplémentaire à mon contrat de location ?

source: Yes, additional drivers can usually be added to the rental agreement for a fee. They'll need to meet the same age and documentation requirements as the primary driver.
ar: نعم، يمكن عادةً إضافة سائقين إضافيين إلى عقد الإيجار مقابل رسوم. سيحتاجون إلى استيفاء نفس متطلبات العمر والوثائق كالسائق الرئيسي.
es: Sí, por lo general, se pueden añadir conductores adicionales al contrato de alquiler por una tarifa. Deberán cumplir con los mismos requisitos de edad y documentación que el conductor principal.
fr: Oui, des conducteurs supplémentaires peuvent généralement être ajoutés au contrat de location moyennant des frais. Ils devront répondre aux mêmes exigences d'âge et de documents que le conducteur principal.

source: What insurance options are available?
ar: ما هي خيارات التأمين المتاحة؟
es: ¿Cuales son las opciones de seguro disponibles?
fr: Quelles options d'assurance sont disponibles ?

source: We offer various insurance options including Collision Damage Waiver (CDW), Loss Damage Waiver (LDW), Personal Accident Insurance (PAI), and Supplemental Liability Insurance (SLI). These options vary by location and may be subject to terms and conditions.
ar: نقدم خيارات تأمين متنوعة تشمل تخليص من الأضرار الناجمة عن التصادم (CDW)، تخليص من الأضرار الناجمة عن الخسارة (LDW)، تأمين الحوادث الشخصية (PAI)، وتأمين المسؤولية الإضافية (SLI). تختلف هذه الخيارات حسب الموقع وقد تخضع لشروط وأحكام.
es: Ofrecemos varias opciones de seguro, incluyendo Exención de Daños por Colisión (CDW), Exención de Daños por Pérdida (LDW), Seguro de Accidentes Personales (PAI) y Seguro de Responsabilidad Suplementaria (SLI). Estas opciones varían según la ubicación y pueden estar sujetas a términos y condiciones.
fr: Nous proposons différentes options d'assurance, notamment la renonciation aux dommages par collision (CDW), la renonciation aux dommages (LDW), l'assurance accident personnelle (PAI) et l'assurance responsabilité supplémentaire (SLI). Ces options varient en fonction de l'emplacement et peuvent être soumises à des conditions.

source: What's the fuel policy?
ar: ما هي سياسة الوقود؟
es: ¿Cual es la política de combustible?
fr: Quelle est la politique en matière de carburant ?

source: Our cars are typically rented with a full tank and should be returned with a full tank. You can choose to prepay for fuel at the time of rental or refill the tank yourself before returning the car.
ar: عادةً، تُستأجر سياراتنا بخزان وقود كامل ويجب إعادتها بخزان وقود كامل. يمكنك اختيار دفع تكلفة الوقود مسبقًا أثناء عملية الإيجار أو إعادة ملء الخزان بنفسك قبل إعادة السيارة.
es: Nuestros coches suelen alquilarse con el depósito lleno y deben devolverse con el depósito lleno. Puedes optar por pagar por adelantado el combustible en el momento del alquiler o rellenar el depósito tú mismo antes de devolver el coche.
fr: Nos voitures sont généralement louées avec un plein d'essence et doivent être restituées avec un plein. Vous pouvez choisir de prépayer le carburant au moment de la location ou de faire le plein vous-même avant de rendre la voiture.

source: Can I modify or cancel my reservation?
ar: هل يمكنني تعديل أو إلغاء حجزي؟
es: ¿Puedo modificar o cancelar mi reserva?
fr: Puis-je modifier ou annuler ma réservation ?

source: Yes, reservations can usually be modified or canceled online or by contacting our customer service, subject to the terms of your booking and any applicable fees.
ar: نعم، يمكن عادةً تعديل أو إلغاء الحجوزات عبر الإنترنت أو عن طريق الاتصال بخدمة العملاء لدينا، وذلك وفقًا لشروط حجزك وأي رسوم قد تنطبق.
es: Sí, por lo general, las reservas se pueden modificar o cancelar en línea o poniéndote en contacto con nuestro servicio de atención al cliente, según los términos de tu reserva y las tarifas aplicables.
fr: Oui, les réservations peuvent généralement être modifiées ou annulées en ligne ou en contactant notre service client, sous réserve des conditions de votre réservation et des frais applicables.

source: Do you offer child seats or other extras?
ar: هل تقدمون مقاعد أطفال أو إضافات أخرى؟
es: ¿Ofrecen asientos infantiles u otros extras?
fr: Proposez-vous des sièges enfants ou d'autres extras ?

source: Yes, we offer a range of extras including child seats, GPS devices, ski racks, and more. These can be selected during the booking process or added at the rental counter.
ar: نعم، نقدم مجموعة من الإضافات بما في ذلك مقاعد الأطفال وأجهزة تحديد المواقع (GPS) وحوامل التزلج وغيرها. يمكن اختيار هذه الإضافات خلال عملية الحجز أو إضافتها في مكتب التأجير.
es: Sí, ofrecemos una variedad de extras que incluyen asientos infantiles, dispositivos GPS, portaequipajes para esquís y más. Estos pueden ser seleccionados durante el proceso de reserva o añadidos en el mostrador de alquiler.
fr: Oui, nous proposons une gamme d'extras, y compris des sièges enfants, des appareils GPS, des porte-skis, et plus encore. Ces options peuvent être sélectionnées lors du processus de réservation ou ajoutées au comptoir de location.

source: Is there a mileage limit?
ar: هل هناك حد للمسافة المقطوعة؟
es: ¿Hay un límite de millaje?
fr: Y a-t-il une limite de kilométrage ?

source: Most rentals come with unlimited mileage, but some promotions or special rates may have mileage restrictions. Please check your reservation details for specific information.
ar: معظم عمليات الإيجار تأتي بدون حد للمسافة المقطوعة، ولكن بعض العروض أو الأسعار الخاصة قد تحتوي على قيود للمسافة المقطوعة. يرجى التحقق من تفاصيل حجزك للحصول على معلومات محددة.
es: La mayoría de los alquileres vienen con millaje ilimitado, pero algunas promociones o tarifas especiales pueden tener restricciones de millaje. Por favor, verifica los detalles de tu reserva para información específica.
fr: La plupart des locations incluent un kilométrage illimité, mais certaines promotions ou tarifs spéciaux peuvent avoir des restrictions de kilométrage. Veuillez consulter les détails de votre réservation pour des informations spécifiques.

source: Can I return the car to a different location?
ar: هل يمكنني إعادة السيارة إلى موقع مختلف؟
es: ¿Puedo devolver el coche a una ubicación diferente?
fr: Puis-je rendre la voiture à un endroit différent ?

source: That depends on the pickup location you choose. In most cases, we offer one-way rentals allowing you to return the car to a different location. Additional fees may apply based on the drop-off location.
ar: ذلك يعتمد على موقع الاستلام الذي تختاره. في معظم الحالات، نقدم إمكانية الإيجار الذهابية التي تسمح لك بإعادة السيارة إلى موقع مختلف. قد تنطبق رسوم إضافية استنادًا إلى موقع إعادة التسليم.
es: Eso depende de la ubicación de recogida que elijas. En la mayoría de los casos, ofrecemos alquileres de solo ida que te permiten devolver el coche a una ubicación diferente. Pueden aplicarse tarifas adicionales según la ubicación de devolución.
fr: Cela dépend de l'endroit de prise en charge que vous choisissez. Dans la plupart des cas, nous proposons des locations en aller simple vous permettant de rendre la voiture à un endroit différent. Des frais supplémentaires peuvent s'appliquer en fonction de l'endroit de restitution.

source: What do I do in case of an emergency or breakdown?
ar: ماذا أفعل في حالة الطوارئ أو العطل؟
es: ¿Qué debo hacer en caso de emergencia o avería?
fr: Que dois-je faire en cas d'urgence ou de panne ?

source: In case of an emergency or breakdown, please contact our 24/7 roadside assistance hotline provided on your rental agreement. We'll provide necessary assistance promptly.
ar: في حالة الطوارئ أو العطل، يرجى الاتصال بخط المساعدة على الطرق السريعة على مدار الساعة والذي يتم توفيره في اتفاقية الإيجار الخاصة بك. سنقدم المساعدة اللازمة على الفور.
es: En caso de emergencia o avería, por favor contacta nuestra línea de asistencia en carretera 24/7 proporcionada en tu contrato de alquiler. Proporcionaremos la asistencia necesaria rápidamente.
fr: En cas d'urgence ou de panne, veuillez contacter notre assistance routière 24h/24 et 7j/7 fournie sur votre contrat de location. Nous vous fournirons une assistance nécessaire rapidement.

source: Rent a car and explore the world
ar: استأجر سيارة واستكشف العالم
es: Alquila un coche y explora el mundo
fr: Louez une voiture et explorez le monde

source: Find the best deals on car rental and enjoy your trip with comfort and convenience.
ar: ابحث عن أفضل العروض على تأجير السيارات واستمتع برحلتك براحة وسهولة.
es: Encuentra las mejores ofertas en alquiler de coches y disfruta tu viaje con comodidad y conveniencia.
fr: Trouvez les meilleures offres de location de voitures et profitez de votre voyage avec confort et commodité.

source: Top Worldwide Destinations
ar: أفضل الوجهات في جميع أنحاء العالم
es: Principales destinos en todo el mundo
fr: Principales destinations mondiales

source: Ready for a new adventure?
ar: هل أنت جاهز لمغامرة جديدة؟
es: ¿Preparado para una nueva aventura?
fr: Prêt pour une nouvelle aventure ?

source: Frequently Asked Questions
ar: الأسئلة المتكررة
es: Preguntas frecuentes
fr: Questions fréquemment posées

source: Competitive prices
ar: أسعار تنافسية
es: Precios competitivos
fr: Prix compétitifs

source: Get the best value for your money with our affordable and transparent rates.
ar: احصل على أفضل قيمة مقابل أموالك مع أسعارنا التنافسية والشفافة.
es: Obtén el mejor valor por tu dinero con nuestras tarifas asequibles y transparentes.
fr: Obtenez le meilleur rapport qualité-prix avec nos tarifs abordables et transparents.

source: Wide selection of cars
ar: مجموعة واسعة من السيارات
es: Amplia selección de coches
fr: Large choix de voitures

source: Choose from a variety of models and brands to suit your needs and preferences.
ar: اختر من بين مجموعة متنوعة من النماذج والعلامات التجارية لتناسب احتياجاتك وتفضيلاتك.
es: Elige entre una variedad de modelos y marcas que se adapten a tus necesidades y preferencias.
fr: Choisissez parmi une variété de modèles et de marques pour répondre à vos besoins et préférences.

source: Convenient locations
ar: مواقع مناسبة
es: Ubicaciones convenientes
fr: Emplacements pratiques

source: Pick up and drop off your car at any of our locations across the countries.
ar: استلم وأسلم سيارتك في أي من مواقعنا في جميع أنحاء البلدان.
es: Recoge y entrega tu coche en cualquiera de nuestras ubicaciones en todo el mundo.
fr: Récupérez et déposez votre voiture dans l'un de nos emplacements à travers les pays.

source: Exceptional customer support
ar: خدمة عملاء استثنائية
es: Soporte excepcional al cliente
fr: Support client exceptionnel

source: Our friendly and professional staff are always ready to assist you with any questions or issues.
ar: فريقنا الودود والمحترف دائماً على استعداد لمساعدتك في أي استفسار أو مشكلة.
es: Nuestro personal amable y profesional siempre está listo para ayudarte con cualquier pregunta o problema.
fr: Notre personnel amical et professionnel est toujours prêt à vous aider pour toute question ou problème.

source: Dubai
ar: دبي
es: Dubái

source: Cairo
ar: القاهرة
es: El Cairo
fr: Le Caire

source: New York
ar: نيويورك
es: Nueva York

source: Rio de Janeiro
ar: ريو دي جانيرو
es: Río de Janeiro

source: Barcelona
ar: برشلونة
fr: Barcelone

source: Paris
ar: باريس
es: París

source: Rome
ar: روما
es: Roma

source: London
ar: لندن
es: Londres
fr: Londres

source: logo
ar: شعار
es: logotipo

source: Terms & Conditions
ar: الشروط والأحكام
es: Términos y condiciones
fr: Conditions générales

source: Contact Us
ar: اتصل بنا
es: Contacto
fr: Nous contacter

source: This web application was built by Nagi Ashraf, a .NET & Angular full-stack developer. You can contact me at: <a href="mailto:{{ email }}" class="hover:underline">{{ email }}</a>
ar: تم بناء هذا التطبيق الويب بواسطة ناجي أشرف، مطور .NET & Angular Full-Stack. يمكنك التواصل معي على: <a href="mailto:{{ email }}" class="hover:underline">{{ email }}</a>
es: Esta aplicación web fue desarrollada por Nagui Áchraf, un desarrollador full-stack de .NET y Angular. Puedes contactarme en: <a href="mailto:{{ email }}" class="hover:underline">{{ email }}</a>
fr: Cette application web a été développée par Nagi Achraf, un développeur full-stack .NET & Angular. Vous pouvez me contacter à : <a href="mailto:{{ email }}" class="hover:underline">{{ email }}</a>

source: Copyright © {{ currentYear }} Nagi. All rights reserved.
ar: حقوق النشر © {{ currentYear }} ناجي. جميع الحقوق محفوظة.
es: Derechos de autor © {{ currentYear }} Nagui. Todos los derechos reservados.
fr: Copyright © {{ currentYear }} Nagi. Tous droits réservés.

source: Select Currency
ar: اختيار العملة
es: Seleccionar moneda
fr: Sélectionner la devise

source: No results found
ar: لا توجد نتائج
es: No se encuentran resultados
fr: Aucun résultat trouvé

source: Pick-up Location
ar: موقع الاستلام
es: Ubicación de recogida
fr: Lieu de prise en charge

source: Drop-off Location
ar: موقع التسليم
es: Ubicación de devolución
fr: Lieu de restitution

source: No drop-off locations found for {{ searchForm.get("pickupLocation")?.value }}
ar: لا توجد مواقع تسليم لـ {{ searchForm.get("pickupLocation")?.value }}
es: No se encontraron ubicaciones de devolución para {{ searchForm.get("pickupLocation")?.value }}
fr: Aucun lieu de restitution trouvé pour {{ searchForm.get("pickupLocation")?.value }}

source: Pick-up date
ar: تاريخ الاستلام
es: Fecha de recogida
fr: Date de prise en charge

source: Time
ar: الوقت
es: Hora
fr: Heure

source: Drop-off date
ar: تاريخ التسليم
es: Fecha de devolución
fr: Date de restitution

source: Time
ar: الوقت
es: Hora
fr: Heure

source: Search
ar: بحث
es: Buscar
fr: Rechercher

source: Drop off at a different location
ar: تسليم السيارة في موقع مختلف
es: Dejar en una ubicación diferente
fr: Déposer dans un lieu différent
